{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "bert-large-cased",
  "bias": "none",
  "corda_config": null,
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 128,
  "lora_bias": false,
  "lora_dropout": 0.01,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "classifier",
    "score"
  ],
  "peft_type": "LORA",
  "r": 128,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "attention.self.key",
    "intermediate.dense",
    "attention.output.dense",
    "attention.self.query",
    "attention.self.value",
    "output.dense"
  ],
  "task_type": "SEQ_CLS",
  "trainable_token_indices": null,
  "use_dora": false,
  "use_rslora": false
}